package uni.pu.fmi;

import cucumber.api.java.en.Given;
import cucumber.api.java.en.Then;
import cucumber.api.java.en.When;

public class DeleteCourseSteps {
	@Given("^Потребителят достъпва страницата за изтриване на маршрут$")
	public void потребителят_достъпва_страницата_за_изтриване_на_маршрут() {
	}

	@When("^Потребителят избере маршрут с идентификатор (\\d+)$")
	public void потребителят_избере_маршрут_с_идентификатор(int arg1) {
	}

	@When("^Потребителят натисне бутона за изтриване на маршрут$")
	public void потребителят_натисне_бутона_за_изтриване_на_маршрут() {
	}

	@Then("^Потребителят вижда съобщение от страницата за изтриване на маршрут \"([^\"]*)\"\\.$")
	public void потребителят_вижда_съобщение_от_страницата_за_изтриване_на_маршрут(String arg1) {
	}

	@Given("^Потребителят е служител$")
	public void потребителят_е_служител() {
	}
}
