
Feature: Изтриване на маршрут

  Scenario: Опит за изтриване на маршрут от потребител, който не е служител
    Given Потребителят достъпва страницата за изтриване на маршрут
    When Потребителят избере маршрут с идентификатор 1
    And Потребителят натисне бутона за изтриване на маршрут
    Then Потребителят вижда съобщение от страницата за изтриване на маршрут "Грешка: нямате нужните права".
    
  Scenario: Опит за изтриване на маршрут, използван в разписанието
    Given Потребителят достъпва страницата за изтриване на маршрут
    And Потребителят е служител
    When Потребителят избере маршрут с идентификатор 0
    And Потребителят натисне бутона за изтриване на маршрут
    Then Потребителят вижда съобщение от страницата за изтриване на маршрут "Грешка: маршрутът не може да бъде изтрит".
    
  Scenario: Опит за изтриване на маршрут, неизползван в разписанието
    Given Потребителят достъпва страницата за изтриване на маршрут
    And Потребителят е служител
    When Потребителят избере маршрут с идентификатор 1
    And Потребителят натисне бутона за изтриване на маршрут
    Then Потребителят вижда съобщение от страницата за изтриване на маршрут "Успешно изтрит запис".