Feature: Изтриване на запис в разписанието

  Scenario: Опит за изтриване на запис в разписанието без избран запис
    Given Потребителят достъпва страницата за изтриване на запис в разписанието
    When Потребителя натиска бутона за изтриване на запис в разписанието
    Then Потребителят вижда съобщение за резултат от опита "Моля, изберете запис за изтриване".
    And Изтритите записи са 0.
    
  Scenario: Опит за изтриване на запис в разписанието като гост
    Given Потребителят достъпва страницата за изтриване на запис в разписанието
    When Потребителя избере запис в разписанието
    And Потребителя натиска бутона за изтриване на запис в разписанието
    Then Потребителят вижда съобщение за резултат от опита "Грешка: не сте логнати в системата".
    And Изтритите записи са 0.
    
  Scenario: Опит за изтриване на запис в разписанието като обикновен потребител
    Given Потребителят достъпва страницата за изтриване на запис в разписанието
    And Потребителя е логнат като  обикновен потребител
    When Потребителя избере запис в разписанието
    And Потребителя натиска бутона за изтриване на запис в разписанието
    Then Потребителят вижда съобщение за резултат от опита "Грешка: нямате необходимите права за изтриване на запис".
    And Изтритите записи са 0.
    
  Scenario: Опит за изтриване на запис в разписанието като служител
    Given Потребителят достъпва страницата за изтриване на запис в разписанието
    And Потребителя е логнат като служител
    When Потребителя избере запис в разписанието
    And Потребителя натиска бутона за изтриване на запис в разписанието
    Then Потребителят вижда съобщение за резултат от опита "Запис успешно изтрит".
    And Изтритите записи са 1.
