Feature: Купуване на електронен билет

	Scenario: Опит за купуване на електронен билет без зададен маршрут
		Given Потребителят достъпва страницата за купуване на електронен билет
		When Потребителят натиска бутона за купуване на електронен билет
		Then Потребителят вижда съобщение "Грешка: няма избран маршрут".

	Scenario: Опит за купуване на електронен билет по зададен маршрут с недостатъчно средства.
		Given Потребителят достъпва страницата за купуване на електронен билет
		And Потребителят разполага с "0" BGN
		When Потребителят избере желания маршрут
		And Потребителят натиска бутона за купуване на електронен билет
		Then Потребителят вижда съобщение "Грешка: недостатъчно средства".
		
	Scenario: Опит за купуване на електронен билет по зададен маршрут с налични средства.
		Given Потребителят достъпва страницата за купуване на електронен билет
		And Потребителят разполага с "5" BGN
		When Потребителят избере желания маршрут
		And Потребителят натиска бутона за купуване на електронен билет
		Then Потребителят вижда съобщение "Успешно закупен електронен билет".